clear;
clc;
param = [
 [1.39,1.40,1.43]           %平均每户就业人数
 [20.6,19.6,19.7]           %人均住房面积
 [44633 48695 52938]        %平均可支配收入
 [49 42 45]                 %空气中可吸入颗粒物日均值-反向
 [575 572 604]              %生活垃圾无害化处理量
 [340 354 343]              %空气质量优良天数
 [92682 96955 104363]       %卫生工作人员数
 [74884 78826 85282]        %卫生技术人员
 [11 11 10]                 %卫生防疫站
 [8 8 8]                    %专科医院
 [2946 3339 3492]           %医疗卫生机构数合计
 [8900.6 9598.3 8705.4]     %总诊疗人次-反向
 [88.5 91.8 92.0]           %国民体质合格率
 [375 246 251]              %参加活动人数
 [200 145 160]              %1000人以上的群体健身活动次数
];
%进行归一化处理
for i=1:15
    for j=3:-1:1
        param(i,j)=param(i,j)/param(i,1);
    end
end
param(12,:)=2-param(12,:);
param(4,:)=2-param(4,:);        %第四列和第十二列的数据和结果成反相关，进行反向操作
%param          %显示归一化结果
%带入计算公式计算
param(:,:) = param(:,:)*100;
res=ones(3);
for i=1:3
    res(i)=calculate(param(:,i));
end
plot(1:3,res,'-r*')
axis([0 4 90 110])
%结果ans =
%
 %  100
%
%
%ans =
%
%          102.267496480749
%
%
%ans =
%
%          107.380934881734
%